#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

int main()
{
	printf("%d\n", 153);
	printf("%d\n", 0153);
	printf("%d\n", 0x153);

	return 0;
}

int main()
{
	//a是整形类型的，a是占4个字节的（32个bit）位的
	//00000000 00000000 00000000 00001010 --原码
	//00000000 00000000 00000000 00001010 --反码
	//00000000 00000000 00000000 00001010 --补码
	int a = 10;
	//10000000000000000000000000001010 - 原码
	//11111111111111111111111111110101 - 反码
	//11111111111111111111111111110110 - 补码

	//11111111111111111111111111110110
	//10000000000000000000000000001001
	//10000000000000000000000000001010

	int b = -10;
	signed int c = -100;
	return 0;
}

int main()
{
	unsigned int num1 = 100;
	unsigned int num2 = -100;
	printf("%d\n", num1);
	printf("%d\n", num2);
	return 0;
}

int main()
{
	int a = 1 - 1;//( 1 + (-1) )
	//00000000000000000000000000000001-  1的原码
	//10000000000000000000000000000001-  -1的原码
	//10000000000000000000000000000010-  -2

	//使用补码计算就正确了
	//00000000000000000000000000000001-  1的补码
	//10000000000000000000000000000001
	//11111111111111111111111111111110
	//11111111111111111111111111111111-  -1的补码
	//00000000000000000000000000000001-  1的补码
	//00000000000000000000000000000000-0
	return 0;
}

int main()
{
	int a = 10;
	int b = a << 1;
	printf("b = %d\n", b);
	printf("a = %d\n", a);

	//a<<2;
	return 0;
}

int main()
{
	int a = -10;
	int b = a << 1;
	//10000000000000000000000000001010 -- 原码
	//11111111111111111111111111110101 -- 反码
	//11111111111111111111111111110110 -- 补码

	//11111111111111111111111111101100 -- 补码 - b
	//10000000000000000000000000010011
	//10000000000000000000000000010100 -- 原码 -20
	printf("b = %d\n", b);
	printf("a = %d\n", a);
	return 0;
}

int main()
{
	int a = 10;
	int b = a >> 1;
	printf("a = %d\n", a);
	printf("b = %d\n", b);
	return 0;
}

int main()
{
	int a = -10;
	int b = a >> 1;
	printf("a = %d\n", a);
	printf("b = %d\n", b);
	//10000000000000000000000000001010
//	//11111111111111111111111111110101
//	//11111111111111111111111111110110
//	//
//	//11111111111111111111111111111011-- 补码 - b
//	//10000000000000000000000000000100
//	//10000000000000000000000000000101 -- -5
	return 0;
}

int main()
{
	int a = 4;
	int b = -7;
	int c = a & b;
	//使用补码进行按位与
	//对应二进制位有0就是0；两个都为1时才是1
	//00000000000000000000000000000100 - 4的补码
//	//10000000000000000000000000000111 -7的原码
//	//11111111111111111111111111111000
//	//11111111111111111111111111111001 -7的补码
//	//00000000000000000000000000000100 - 4的补码
//	//00000000000000000000000000000000 -0
//	//
	printf("%d\n", c);
	return 0;
}

int main()
{
	int a = 4;
	int b = -7;
	int c = a | b;
	//使用补码进行按位或
//	//对应二进制位有1就是1，两个同时为0才为0
//	//00000000000000000000000000000100 - 4的补码
//	//10000000000000000000000000000111 -7的原码
//	//11111111111111111111111111111000
//	//11111111111111111111111111111001 -7的补码
//	//00000000000000000000000000000100 - 4的补码
//	//11111111111111111111111111111101 - c中的补码
//	//10000000000000000000000000000010
//	//10000000000000000000000000000011 - 原码
	printf("%d\n", c);
	return 0;
}

int main()
{
	int a = 4;
	int b = -7;
	int c = a ^ b;
	// 使用补码进行按位异或
		//	//规则：相同为0，相异位1
		//	//00000000000000000000000000000100 - 4的补码
		//	//10000000000000000000000000000111 -7的原码
		//	//11111111111111111111111111111000
		//	//11111111111111111111111111111001 -7的补码
		//	//00000000000000000000000000000100 - 4的补码
		//	//11111111111111111111111111111101 c中的补码
		//	//10000000000000000000000000000010
		//	//10000000000000000000000000000011 c的原码
	printf("%d\n", c);
	return 0;
}

int main()
{
	int a = 0;
	int b = ~a;
	//00000000000000000000000000000000 - 补码
//	//11111111111111111111111111111111 - b中的补码
//	//10000000000000000000000000000000
//	//10000000000000000000000000000001 -- -1
	printf("%d\n", b);
	return 0;
}

//写一个代码，完成两个整数的交换
int main()
{
	int a = 3;
	int b = 5;
	int c = 0;
	printf("交换前：a = %d b = %d\n", a, b);
	c = a;
	a = b;
	b = c;
	printf("交换后：a = %d b = %d\n", a, b);
	return 0;
}

int main()
{
	int a = 3;
	int b = 5;
	//当a和b的值较大的时候，可能会出现溢出的情况
	printf("交换前：a = %d b = %d", a, b);
	a = a + b;
	b = a - b;
	a = a - b;
	printf("交换后：a=%d b = %d", a, b);
	return 0;
}

//异或运算的一些特殊场景
//相同为0 相异为1
//a^a = 0;
//a^0 = a;
//3^3^5 = 5
//

int main()
{
	int a = 3;
	int b = 5;
	printf("交换前：a = %d b = %d", a, b);
	a = a ^ b;
	b = a ^ b;
	a = a ^ b;
	printf("交换后：a = %d b = %d", a, b);
	return 0;
}

int count_one_of_bit(unsigned int m)
{
	int count = 0;
	while (m)
	{
		if (m % 2 == 1)
		{
			count++;
			m = m / 2;
		}
	}
	return count;
}

int main()
{
	int n = 0;
	scanf("%d", &n);
	int ret = count_one_of_bit(n);
	printf("%d\n", ret);
	return 0;
}

int count_one_of_bit(unsigned int m)
{
	int count = 0;
	int i = 0;
	for (i = 0; i < 32; i++)
	{
		if (((m >> i) & 1) == 1)
		{
			count++;
		}
	}
	return count;
}

int main()
{
	int n = 0;
	scanf("%d", &n);
	int ret = count_one_of_bit(n);
	printf("%d\n", ret);
	return 0;
}

int count_one_of_bit(unsigned int m)
{
	int count = 0;
	while (m)
	{
		count++;
		m = m & (m - 1);
	}
	return count;
}
int main()
{
	int n = 0;
	scanf("%d", &n);
	int ret = count_one_of_bit(n);
	printf("%d\n", ret);
	return 0;
}

int main()
{
	int n = 13;
	//00000000000000000000000000011101
//	//11111111111111111111111111101111
//	//00000000000000000000000000010000
//	// 1<<(5-1)
//	//将n的第5位改成1
	n = n | (1 << 4);
	printf("%d\n", n);
	n = n & (~(1 << 4));
	//将n的第五位改成0
	printf("%d\n", n);
	return 0;
}